In [17]:
import sqlite3

try:
    connection = sqlite3.connect(':memory:')
    cursor = connection.cursor()
    print("Successfully connected to SQLite database")
except Exception as e:
    print(f"Error while connecting to SQLite: {e}")
    connection = None

Successfully connected to SQLite database

# MySQL Database Operations
## Create Tables and Perform WHERE, ORDER BY, and LIKE Operations

### Create Department Table

In [18]:
sql = """CREATE TABLE Department (
    dept_id INT PRIMARY KEY,
    dept_name VARCHAR(50),
    location VARCHAR(50),
    budget INT
)"""

try:
    cursor.execute("DROP TABLE IF EXISTS Department")
    cursor.execute(sql)
    print("Department table created successfully")
except Exception as e:
    print(f"Error: {e}")

Department table created successfully

### Create Employee Table

In [19]:
sql = """CREATE TABLE Employee (
    emp_id INT PRIMARY KEY,
    emp_name VARCHAR(50),
    dept_id INT,
    salary INT,
    hire_date TEXT
)"""

try:
    cursor.execute("DROP TABLE IF EXISTS Employee")
    cursor.execute(sql)
    print("Employee table created successfully")
except Exception as e:
    print(f"Error: {e}")

Employee table created successfully

### Insert Department Data

In [20]:
sql = """INSERT INTO Department VALUES
(1, 'IT', 'New York', 500000),
(2, 'HR', 'Boston', 250000),
(3, 'Sales', 'New York', 400000),
(4, 'Marketing', 'Chicago', 300000)"""

try:
    cursor.execute(sql)
    connection.commit()
    print(f"Inserted 4 records into Department table")
except Exception as e:
    print(f"Error: {e}")

Inserted 4 records into Department table

### Insert Employee Data

In [21]:
sql = """INSERT INTO Employee VALUES
(101, 'Aman Singh', 1, 75000, '2020-05-15'),
(102, 'Abhinav sharma', 1, 85000, '2019-03-22'),
(103, 'Aks abhi', 3, 70000, '2021-07-10'),
(104, 'Praveen', 2, 65000, '2018-11-05'),
(105, 'KK sumayi', 3, 72000, '2020-09-12'),
(106, 'Rk garg', 4, 68000, '2021-01-18')"""

try:
    cursor.execute(sql)
    connection.commit()
    print(f"Inserted 6 records into Employee table")
except Exception as e:
    print(f"Error: {e}")

Inserted 6 records into Employee table

### Query 1: WHERE with AND
Find employees in IT department (dept_id=1) with salary > 80000

In [22]:
sql = "SELECT * FROM Employee WHERE dept_id = 1 AND salary > 80000"

try:
    cursor.execute(sql)
    results = cursor.fetchall()
    print("Employees in IT department with salary > 80000:")
    for row in results:
        print(row)
except Exception as e:
    print(f"Error: {e}")

Employees in IT department with salary > 80000:
(102, 'Abhinav sharma', 1, 85000, '2019-03-22')

### Query 2: WHERE with OR
Find employees in IT or Sales departments

In [23]:
sql = "SELECT * FROM Employee WHERE dept_id = 1 OR dept_id = 3"

try:
    cursor.execute(sql)
    results = cursor.fetchall()
    print("Employees in IT or Sales departments:")
    for row in results:
        print(row)
except Exception as e:
    print(f"Error: {e}")

Employees in IT or Sales departments:
(101, 'Aman Singh', 1, 75000, '2020-05-15')
(102, 'Abhinav sharma', 1, 85000, '2019-03-22')
(103, 'Aks abhi', 3, 70000, '2021-07-10')
(105, 'KK sumayi', 3, 72000, '2020-09-12')

### Query 3: WHERE with NOT
Find employees not in Marketing department (dept_id != 4)

In [11]:
sql = "SELECT * FROM Employee WHERE NOT dept_id = 4"

try:
    cursor.execute(sql)
    results = cursor.fetchall()
    print("Employees not in Marketing department:")
    for row in results:
        print(row)
except Exception as e:
    print(f"Error: {e}")

Employees not in Marketing department:

### Query 4: ORDER BY
Sort employees by salary in descending order

In [12]:
sql = "SELECT * FROM Employee ORDER BY salary DESC"

try:
    cursor.execute(sql)
    results = cursor.fetchall()
    print("Employees sorted by salary (highest to lowest):")
    for row in results:
        print(row)
except Exception as e:
    print(f"Error: {e}")

Employees sorted by salary (highest to lowest):

### Close Connection

### Query 5: LIKE
Find employees whose names start with 'J'

In [13]:
sql = "SELECT * FROM Employee WHERE emp_name LIKE 'J%'"

try:
    cursor.execute(sql)
    results = cursor.fetchall()
    print("Employees whose names start with 'J':")
    for row in results:
        print(row)
except Exception as e:
    print(f"Error: {e}")

Employees whose names start with 'J':

### Close Connection

In [ ]:
if connection:
    cursor.close()
    connection.close()
    print("SQLite connection is closed")